import QtQuick 2.7
import "../widget"

Room {
    Fligable {
        anchors.fill: parent
        anchors.leftMargin: 0.05 * parent.width
        anchors.rightMargin: 0.05 * parent.width
        anchors.topMargin: 0.1 * parent.height
        anchors.bottomMargin: 0.1 * parent.height
        blaText: blabla
    }

    readonly property string blabla:
        "<h3>为什么要做这个</h3>"+
        "<ul>" +
        "<li>市面上有关saki的麻将游戏在技能还原度方面都不尽如人意</li>" +
        "<li>玩着玩着，每当遇到和原作表现不一样的地方，还是很郁闷的</li>" +
        "<li>于是就一怒之下启动了这个项目，妄图做出一个高度还原的saki世界</li>" +
        "</ul>" +
        "<h3>关于操作</h3>" +
        "<ol>" +
        "<li>手机版牌小容易点错/场棒挡角色名/宝牌指示牌被挡看不见<ul>" +
            "<li>Pinch手势缩放/按住头像/按住桌中央方块</li></ul></li>" +
        "<li>未来视操作不方便<ul>" +
            "<li>目前方案为临时测试用，将来会改进</li></ul></li>" +
        "<li>可否添加宝牌发光/自摸切变暗/听牌提示/安牌提示/振听提示等功能<ul>" +
            "<li>为了向实体麻将和天凤看齐，坚持不加现实中没有的辅助性效果</li>" +
            "<li>闪电、掀桌、摔牌、爆灯等不降低难度的装饰性效果是肯定会加的</li></ul></li>" +
        "</ol>" +
        "<h3>关于制作计划</h3>" +
        "<ol>" +
        "<li>什么时候更新/更新是否有规律？<ul>" +
            "<li>看心情<img src=\"qrc:///pic/icon/huaji.png\"/></li></ul></li>" +
        "<li>是否开源？<ul>" +
            "<li>https://github.com/mjpancake</li></ul></li>" +
        "<li>为什么不做xx功能/xx角色/xx能力/音乐/音效/头像/立绘？<ul>" +
            "<li>你不是也没做吗<img src=\"qrc:///pic/icon/huaji.png\"/></li>" +
            "<li>伸手谁都会，脑洞没卵用。欢迎参与制作，走上人生巅峰" +
                "<img src=\"qrc:///pic/icon/huaji.png\"/></li></ul></li>" +
        "<li>如何参与制作？<ul>" +
            "<li>制作组聊天室 https://gitter.im/mjpancake</li>" +
            "<li>聊天室对所有人开放，加入无须申请，随意围观吐槽</li>" +
            "<li>想进一步了解更多信息的，聊天室内私信@rolevax</li></ul></li>" +
        "</ol>" +
        "<h3>关于角色能力</h3>" +
        "<ol>" +
            "<li>有矛盾的能力之间怎么排优先级？<ul>" +
                "<li>一切遵照原作</li>" +
                "<li>原作未交代的情况，依常理喵咩处理，保留讨论余地</li></ul></li>" +
            "<li>丰音追立后对手没有摸铳/诚哥三副露无自摸/Ako鸣牌做不成一通/……<ul>"+
                "<li>山里没有了，全在他家手里</li>" +
                "<li>只有少数能力由于其本身性质带有山存量保证特性</li></ul></li>" +
            "<li>段位战中怜的预测不准<ul>"+
                "<li>……</li></ul></li>" +
            "<li>卷饼/南帝/夕哥/怜/京狗……过于容易做成xxx手役，与原作不符<ul>"+
                "<li>有明显牌风倾向的，文档中都会有直接或间接的说明</li>" +
                "<li>文档中毫无说明的，并没有特别加上手役倾向——倾向感多半是以偏概全的错觉</li></ul></li>" +
            "<li>a能力比b能力优先，这不合理<ul>" +
                "<li>如果是和已有剧情直接冲突的现象，会立即做出修改</li>" +
                "<li>如果只是个人推论，意见将予以保留</li></ul></li>" +
            /*
            "<li>洋榎点炮了<ul>"+
                "<li>可能是立直后被上铳系能力或鸣牌错位所坑</li>" +
                "<li>可能是\"立直后山里只剩铳牌\"等没办法的极端情况所致</li></ul></li>" +
            */
        "</ol>" +
        "<h3>关于“建议加强/削弱某角色”</h3>" +
        "<ol>" +
            "<li>请先分清楚到底是角色弱还是自己水平低<ul>" +
                "<li>不建议通过本作入门日麻</li>" +
                "<li>不建议通过本作入门日麻</li>" +
                "<li>不建议通过本作入门日麻</li></ul></li>" +
            "<li>原作是判别强弱的唯一标准，统计是衡量强弱的唯一手段<ul>" +
                "<li>标准提案格式：原作中据统计……，游戏中据统计……，所以xx太强/太弱</li></ul></li>" +
            "<li>不要见风就是雨<ul>" +
                "<li>\"原作xx没和过混一色\"推不出\"xx无法和混一色\"这个结论（p-value不足）</li>" +
                "<li>\"原作中xx从未放铳\"推不出\"xx会透视\"这个结论（充分不必要）</li>" +
                "<li>提案前请确信自己仔细想过p-value以及充分/必要性的问题</li></ul></li>" +
            "<li>这样的建议基本上会被无视掉：<ul>" +
                "<li>\"xx太弱，用了好几把都吃四，须加强\"</li>" +
                "<li>\"遇到xx根本赢不了，须削弱\"</li>" +
                "<li>\"丰音的先负被所有人防备，根本用不上，须改进\"</li>" +
                "<li>\"用初美东北全被人扣，一次四喜都没和过，须改进\"</li>" +
                "<li>\"今天用咲居然一次都没杠到，这不科学\"</li>" +
                "<li>\"茶杯无限天和太没节操了，必须削\"</li>" +
                "<li>\"京狗国士/双立直/抢杠/花式避铳/……，建议削京狗\"</li>" +
                "<li>以上提案不被接受的原因在之前给出的几点里都能找到答案</li></ul></li>" +
            "<li>这样的建议容易被接受：<ul>" +
                "<li>\"<u>原作</u>中咲也会做平和，" +
                    "而游戏中<u>统计</u>15把每把都是对子手，所以要改进\"</li>" +
                "<li>\"<u>原作</u>中照的平均和了巡目在6巡左右，" +
                    "而游戏中<u>统计</u>10把平均8巡，所以要加强\"</li>" +
                "<li>\"<u>原作</u>中慕的平和率是40%，" +
                    "而<u>写程序模拟了1万局</u>平和率30%，所以要提高平和率\"</li></ul></li>" +
        "</ol>" +
        "<h3>关于规则</h3>" +
        "<ol>" +
        "<li>为毛和不了<ul>" +
            "<li>确认是否<i>无役</i>或<i>振听</i></li>" +
            "<li>部分角色有附加的和牌限制（参考\"文档->角色能力\"）</li></ul></li>" +
        "<li>点了“终了”为毛又开始下一局<ul>" +
            "<li>按钮只表意愿，他家的尾庄top选择了续行</li></ul></li>" +
        "</ol>"
}
