import QtQuick 2.0
import "../widget"

Room {
    Fligable {
        anchors.fill: parent
        anchors.leftMargin: 0.05 * parent.width
        anchors.rightMargin: 0.05 * parent.width
        anchors.topMargin: 0.1 * parent.height
        anchors.bottomMargin: 0.1 * parent.height
        blaText: blabla
    }

    readonly property string blabla:
        "<h3>关于制作计划</h3>" +
        "<ol>" +
        "<li>为什么要做这个<ul>"+
            "<li>有关saki的游戏，大多为制作方便经过了简化，技能设定和原作有所出入，例如：<ul>" +
                "<li>怜只能看到下一巡自摸牌（原作中可看到下一巡所有现象）</li>" +
                "<li>堇的能力为直接给对手上铳（原作中为自己手牌向对手弃牌靠拢）</li>" +
                "<li>久、衣等角色时常遇到山存不够而无法自摸的情况（与能力本身相悖）</li>" +
                "<li>纯、憧、末原的能力简化为鸣牌buff/debuff（其实相当值得研究）</li>" +
                "<li>真子能力只能预测铳牌（原作中还能预测他家和牌，几乎半个未来视）</li>" +
                "<li>咲的\"被人杠则开不了花\"被后续剧情打脸</li>" +
                "<li>能力的发动条件的差别（主动/被动，随时/限场合，次数有限/无限，可叠加/互斥）</li>" +
                "<li>各种手感与细节的差异，不一一列举</li></ul></li>" +
            "<li>因此我们觉得应该有一个贯彻了吧友们多年来的研究，最大限度接近原作的游戏</li>" +
            "<li>于是就做了这个</li></ul></li>" +
        "<li>什么时候更新/更新是否有规律<ul>" +
            "<li>制作组成员都是在工作学习之余抽空做的，\"什么时候有空\"本身就是个未知数</li>" +
            "<li>因此预测更新时间也是十分困难——同为苦B青年，还望共勉</li></ul></li>" +
        "<li>为什么没有音乐、音效、头像、立绘<ul>" +
            "<li>缺人——我们需要有爱+有闲的大触</li></ul></li>" +
        "<li>为什么没有咲/衣/照/稳乃/小蒔……<ul>" +
            "<li>当年发布0.1的时候，别说卷饼，连京狗都没有——那个时候倒是没人问为什么没有京狗</li>" +
            "<li>可后来随着人物变多，问这种问题的人反而变得越来越多了</li>" +
            "<li>所以说你们人类啊……算了不说了<img src=\"qrc:///pic/icon/huaji.png\"/></li></ul></li>" +
        "</ol>" +
        "<h3>关于角色能力</h3>" +
        "<ol>" +
            "<li>有矛盾的能力之间的优先级问题<ul>"+
                "<li>已知优先级的按已知的来，如SM连携可破笨淡序盘支配</li>" +
                "<li>优先级未知的情况下，大体上发动机会越小的越优先</li>" +
                "<li>多数能力间都是相对强弱的关系，如无必要不另行设定绝对的优先级</li>" +
                "<li>发牌姬会尽可能地让所有人的能力无冲突地同时生效</li></ul></li>" +
            "<li>丰音追立后对手没有摸铳/诚哥三副露无自摸/AKO鸣牌做不成一通/……<ul>"+
                "<li>山里没有了，全在他家手里</li>" +
                "<li>只有少数能力有山存量保证特性——通常为主攻/魔物级</li></ul></li>" +
        "</ol>" +
        "<h3>建议加强/削弱某角色</h3>" +
        "<ol>" +
            "<li>在对\"太强/太弱\"下结论之前，请确信自己看到的不是偶然<ul>" +
                "<li>由于不存在“剧情需要”，游戏的偶然性必然大于动漫，个别几局看不出强弱</li>" +
                "<li>对于同样的角色，不同的玩家可能有截然相反的评价——血统问题</li>" +
                "<li>有些人在版本更新后会感叹xx变强了，xx变弱了之类——实际上可能根本没动，神经过敏罢了</li>" +
                "<li>京狗天和并不奇怪——三次元也有天和，而且我们没有理由禁止京狗天和</li>" +
                "<li>排除偶然的办法是<u><i>统计</i></u>——身经百战才能避免见风是雨</li></ul></li>" +
            "<li>在对\"太强/太弱\"下结论之前，请确信自己的打法没有大毛病<ul>" +
                "<li>强弱和使用者的水平（雀力基础+对挂的理解深度）有很大关系</li>" +
                "<li>麻将是智力游戏，开挂改变不了这一点。大家都有挂，最终还是在比智力</li></ul></li>" +
            "<li>本作的目标是还原度，只有\"比原作中弱/比原作中强\"才能成为加强/削弱的理由<ul>" +
                "<li><u><i>平衡性不能成为理由</i></u>——原作中各角色之间本来就是不平衡的</li>" +
                "<li>将来会从宏观报酬机制上解决公平问题（弱胜强奖励大，反之亦然）</li></ul></li>" +
            "<li>不要忘了麻将是4股势力之间的对抗，赢一输三才是正常<ul>" +
                "<li>在原作中，绝大多数的能力一次半庄中只能成功展现<u><i>1～3次</i></u></li>" +
                "<li>对于多数角色，大半时间都不是开挂的好时机，应当自己动脑全力以赴</li>" +
                "<li>使用能力的时机很重要，同时也需要运气。每次开挂都和到牌这种怪事期待不得</li></ul></li>" +
            "<li>这样的建议基本不会被接受：<ul>" +
                "<li>\"诚哥太弱，用了好几把都吃四，须加强\"</li>" +
                "<li>\"遇到兔子根本赢不了，须削弱\"</li>" +
                "<li>\"丰音的先负被所有人防备，根本用不上，须改进\"</li>" +
                "<li>\"用初美东北全被人扣，一次四喜都没和过，须改进\"</li>" +
                "<li>\"今天用咲居然一次都没杠到，这不科学\"</li>" +
                "<li>\"茶杯无限天和太没节操了，必须削\"</li>" +
                "<li>\"港姐完全不会用，要改得好用一些\"</li>" +
                "<li>\"龙华的仙人指路完全记不住出牌顺序，应该改\"</li>" +
                "<li>\"真子摘了眼镜弃牌都看不到这怎么打，应该改\"</li>" +
                "<li>以上提案不被接受的原因在之前给出的几点里都能找到答案</li></ul></li>" +
            "<li>这样的建议容易被接受：<ul>" +
                "<li>\"<u>原作</u>中咲也会走平和线，" +
                    "而游戏中<u>统计</u>15把每把都是对子手，所以要改进\"</li>" +
                "<li>\"<u>原作</u>中照的平均和了巡目在5巡左右，" +
                    "而游戏中<u>统计</u>10把平均7巡，所以要加强\"</li>" +
                "<li>\"<u>原作</u>中慕的平和率是40%，" +
                    "而游戏中<u>统计</u>20把平和14次，所以要降低平和率\"</li>" +
                "<li>凡出现关键词\"原作\"与\"统计\"的提案都会被优先重视</li></ul></li>" +
        "</ol>" +
        "<h3>关于规则</h3>" +
        "<ol>" +
        "<li>为毛和不了<ul>" +
            "<li>确认是否<i>无役</i>或<i>振听</i></li>" +
            "<li>部分角色有附加的和牌限制（参考\"文档->角色能力\"）</li></ul></li>" +
        "<li>点了“终了”为毛又开始下一局<ul>" +
            "<li>按钮只表意愿，他家的尾庄top选择了续行</li></ul></li>" +
        "</ol>" +
        "<h3>关于操作</h3>" +
        "<ul>" +
        "<li>如何吃/碰/杠<ul>" +
            "<li>加杠按钮在副露上，其余的吃碰杠按钮在牌上</li>" +
            "<li>出现多种吃/碰/杠选项时，左箭头为吃，下箭头为碰，方块为杠</li></ul></li>" +
        "</ul>" +
        "</ul>"
}
