import QtQuick 2.7
import "../widget"

Room {
    Fligable {
        anchors.fill: parent
        anchors.leftMargin: 0.05 * parent.width
        anchors.rightMargin: 0.05 * parent.width
        anchors.topMargin: 0.1 * parent.height
        anchors.bottomMargin: 0.1 * parent.height
        blaText: blabla
    }

    readonly property string blabla:
        "<h3>为什么要做这个</h3>"+
            "<ul>" +
            "<li>有关saki的游戏，大多为制作方便经过了简化，表现和原作有所出入，例如：<ul>" +
                "<li>未来视、仙人指路完全成为另一个不同的技能</li>" +
                "<li>堇的能力简化为瘟神威</li>" +
                "<li>久时常遇到山存不够的情况，与能力本身相悖</li>" +
                "<li>钓鱼七对化，明杠不算碰</li>" +
                "<li>淡的自摸切w立及开杠前食和问题</li>" +
                "<li>纯、憧、末原的能力简化为鸣牌buff/debuff</li>" +
                "<li>照、姬子简化为粗略进张加成，点数/番数控制松散</li>" +
                "<li>真子只能读铳，无法预测他家的自摸及打点</li>" +
                "<li>咲的\"被人杠则开不了花\"被后续剧情打脸</li>" +
                "<li>能力的发动条件的差别（主动/被动，随时/限场合，可叠加/互斥）</li>" +
                "<li>牌山性质诡异，没有鸣牌错位的概念</li>" +
                "<li>最终型常由配牌死板决定，无法上演各种神进张剧情</li>" +
                "<li>各种手感与细节的差异，不一一列举</li></ul></li>" +
            "<li>因此我们觉得应该有一个贯彻了吧友们多年来的研究，不向制作难题妥协的游戏</li>" +
            "<li>于是就启动了这个项目，目标是做出一个高度还原的saki世界</li></ul></li>" +
        "<h3>关于制作计划</h3>" +
        "<ol>" +
        "<li>什么时候更新/更新是否有规律<ul>" +
            "<li>不定期无规律更新</li></ul></li>" +
        "<li>为什么没有音乐、音效、头像、立绘<ul>" +
            "<li>欢迎贡献原创音乐/自绘图像资源，贴吧回复资源地址即可</li></ul></li>" +
        "<li>为什么没有咲/衣/照/稳乃/小蒔……<ul>" +
            "<li>Talk is cheap, show me the code</li></ul></li>" +
        "<li>xx功能/xx能力很容易实现，为什么不去做？<ul>" +
            "<li>Talk is cheap, show me the code</li></ul></li>" +
        "<li>为什么不改善xx体验？<ul>" +
            "<li>Talk is cheap, show me the code</li></ul></li>" +
        "<li>如何show窝的code？<ul>" +
            "<li>先加Gitter：https://gitter.im/mjpancake</li>" +
            "<li>GitHub：https://github.com/mjpancake</li>" +
            "<li>然后开始过上没羞没臊的幸福生活</li></ul></li>" +
        "</ol>" +
        "<h3>关于角色能力</h3>" +
        "<ol>" +
            "<li>有矛盾的能力之间的优先级问题<ul>"+
                "<li>已知优先级的按已知的来，如SM连携可破笨淡序盘支配</li>" +
                "<li>优先级未知的情况下，大体上发动机会越小的越优先</li>" +
                "<li>多数能力间都是相对强弱的关系，如无必要不另行设定绝对的优先级</li>" +
                "<li>发牌姬会尽可能地让所有人的能力无冲突地同时生效</li></ul></li>" +
            "<li>丰音追立后对手没有摸铳/诚哥三副露无自摸/AKO鸣牌做不成一通/……<ul>"+
                "<li>山里没有了，全在他家手里</li>" +
                "<li>只有少数能力由于其本身性质带有山存量保证特性</li></ul></li>" +
            "<li>卷饼/南帝/夕哥/怜/京狗……过于容易做成xxx手役，与原作不符<ul>"+
                "<li>有明显牌风倾向的，文档中都会有直接或间接的说明</li>" +
                "<li>文档中毫无说明的，并没有特别加上手役倾向——倾向感多半是以偏概全的错觉</li></ul></li>" +
            "<li>段位战中怜的预测不准<ul>"+
                "<li>……</li></ul></li>" +
            "<li>洋榎点炮了<ul>"+
                "<li>可能是立直后被上铳系能力或鸣牌错位所坑</li>" +
                "<li>可能是\"立直后山里只剩铳牌\"等没办法的极端情况所致</li></ul></li>" +
        "</ol>" +
        "<h3>建议加强/削弱某角色</h3>" +
        "<ol>" +
            "<li>\"太强/太弱\"的结论只能由统计分析得出，而不是个人感觉<ul>" +
                "<li>由于不存在“剧情需要”，游戏的偶然性必然大于动漫，个别几局看不出强弱</li>" +
                "<li>很多东西要看脸。烧鸡一个半庄就觉得xx太弱，实乃图森破</li>" +
                "<li>短期内决定输赢的首先是运气，技术也很重要——常有人过度强调挂的影响</li>" +
                "<li>有人在版本更新后感叹xx变强，xx变弱了之类——实际可能根本没动，错觉罢了</li>" +
                "<li>京狗天和并不奇怪——三次元也有天和，而且我们没有理由禁止京狗天和</li>" +
                "<li>排除偶然的办法是<u><i>统计</i></u>——身经百战才能避免见风是雨</li></ul></li>" +
            "<li>在对\"太强/太弱\"下结论之前，请确信自己的打法没有大毛病<ul>" +
                "<li>开挂不等于无脑，参考\"文档->推荐打法\"</li></ul></li>" +
            "<li>本作没有角色之间的平衡概念，只会作为代替另寻方案，例如：<ul>" +
                "<li>段位战中实力相差过大的角色不会同桌（见\"文档->段位规则\"）</li>" +
                "<li>将来的团体战中会有类似cost或社团经费（照的零食开销）之类的概念</li>" +
                "<li>总之从还原度宗旨出发，角色间的强弱差距应当原样保留</li></ul></li>" +
            "<li>这样的建议基本不会被接受：<ul>" +
                "<li>\"诚哥太弱，用了好几把都吃四，须加强\"</li>" +
                "<li>\"遇到兔子根本赢不了，须削弱\"</li>" +
                "<li>\"丰音的先负被所有人防备，根本用不上，须改进\"</li>" +
                "<li>\"用初美东北全被人扣，一次四喜都没和过，须改进\"</li>" +
                "<li>\"今天用咲居然一次都没杠到，这不科学\"</li>" +
                "<li>\"茶杯无限天和太没节操了，必须削\"</li>" +
                "<li>\"港姐完全不会用，要改得好用一些\"</li>" +
                "<li>\"M哥一低头连牌都看不到这怎么打，应该改\"</li>" +
                "<li>以上提案不被接受的原因在之前给出的几点里都能找到答案</li></ul></li>" +
            "<li>这样的建议容易被接受：<ul>" +
                "<li>\"<u>原作</u>中咲也会做平和，" +
                    "而游戏中<u>统计</u>15把每把都是对子手，所以要改进\"</li>" +
                "<li>\"<u>原作</u>中照的平均和了巡目在6巡左右，" +
                    "而游戏中<u>统计</u>10把平均8巡，所以要加强\"</li>" +
                "<li>\"<u>原作</u>中慕的平和率是40%，" +
                    "而游戏中<u>统计</u>20把平和14次，所以要降低平和率\"</li>" +
                "<li>凡出现关键词\"原作\"与\"统计\"的提案都会被优先重视</li></ul></li>" +
        "</ol>" +
        "<h3>关于规则</h3>" +
        "<ol>" +
        "<li>为毛和不了<ul>" +
            "<li>确认是否<i>无役</i>或<i>振听</i></li>" +
            "<li>部分角色有附加的和牌限制（参考\"文档->角色能力\"）</li></ul></li>" +
        "<li>点了“终了”为毛又开始下一局<ul>" +
            "<li>按钮只表意愿，他家的尾庄top选择了续行</li></ul></li>" +
        "</ol>" +
        "<h3>关于操作</h3>" +
        "<ol>" +
        "<li>手机版牌太小容易点错<ul>" +
            "<li>参考\"文档->操作说明\"</li></ul></li>" +
        "<li>场棒挡住角色名<ul>" +
            "<li>参考\"文档->操作说明\"</li></ul></li>" +
        "<li>宝牌指示牌被挡住看不见<ul>" +
            "<li>参考\"文档->操作说明\"</li></ul></li>" +
        "<li>如何吃/碰/杠<ul>" +
            "<li>加杠按钮在副露上，其余的吃碰杠按钮在牌上</li>" +
            "<li>出现多种吃/碰/杠选项时，左箭头为吃，下箭头为碰，方块为杠</li></ul></li>" +
        "</ol>"
}
